paypal-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/paypal/refundCapturedPayment.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.paypal.refundCapturedPayment">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:paypalApiUrl>https://api.sandbox.paypal.com</urn:paypalApiUrl>
      <urn:authorization>Bearer J2rIYYtGxmjEJGkHwf3tVEXpsjO9EsavwSZFSwfCaRI</urn:authorization>
      <urn:captureid>8F148933LY9388354</urn:captureid>
      <urn:currency>USD</urn:currency>
      <urn:total>110.54</urn:total>
   </soapenv:Body>
</soapenv:Envelope>
